In [4]:
import pandas as pd

dataset = pd.read_csv('dataset.csv')

print("Original dataset:")
print(dataset.to_string(index=False))

Original dataset:
 Col1 Col2  Col3 Col4
    1    A     1    D
    2    B     2    D
    3    C     3    D
    4    D     4    D
    4    D     4    D
    5    E     5    D
    6    F     6    D
    7    G     7    D
    7    G     7    D
    8    H     8    D
    9    I     9    D
   10    J    10    D
   10    J    10    D
   10    J    10    D
   11    K    11    D
   12    L    12    D
   13    M    13    D
   13    M    13    D
   14    N    14    D
   15    O    15    D
   16    P    16    D
   17    Q    17    D
   18    R    18    D
   19    S    19    D
   20    T    20    D
   20    T    20    D
   20    T    20    D
   21    U    21    D
   22    V    22    D
   23    W    23    D

In [5]:
#Delete rows that contain duplicate data
dataset_duplicates_removed = dataset.drop_duplicates()
print("\nDataset with duplicate rows removed:")
print(dataset_duplicates_removed.to_string(index=False))

Dataset with duplicate rows removed:
 Col1 Col2  Col3 Col4
    1    A     1    D
    2    B     2    D
    3    C     3    D
    4    D     4    D
    5    E     5    D
    6    F     6    D
    7    G     7    D
    8    H     8    D
    9    I     9    D
   10    J    10    D
   11    K    11    D
   12    L    12    D
   13    M    13    D
   14    N    14    D
   15    O    15    D
   16    P    16    D
   17    Q    17    D
   18    R    18    D
   19    S    19    D
   20    T    20    D
   21    U    21    D
   22    V    22    D
   23    W    23    D

In [6]:
#Delete columns that contain a single value
dataset_columns_removed = dataset_duplicates_removed.loc[:, dataset_duplicates_removed.nunique() > 1]
print("\nDataset with columns containing a single value removed:")
print(dataset_columns_removed.to_string(index=False))

Dataset with columns containing a single value removed:
 Col1 Col2  Col3
    1    A     1
    2    B     2
    3    C     3
    4    D     4
    5    E     5
    6    F     6
    7    G     7
    8    H     8
    9    I     9
   10    J    10
   11    K    11
   12    L    12
   13    M    13
   14    N    14
   15    O    15
   16    P    16
   17    Q    17
   18    R    18
   19    S    19
   20    T    20
   21    U    21
   22    V    22
   23    W    23

**One Hot Encoding**

In [21]:
import numpy as np
import pandas as pd
  
data = pd.read_csv('P3_one_hot_encoding.csv')
data.head()

   Employee_ID  Gender Remarks
0           45    Male    Nice
1           78  Female    Good
2           56  Female   Great
3           12    Male   Great
4            7  Female    Nice

In [22]:
one_hot_encoded_data = pd.get_dummies(data, columns = ['Remarks', 'Gender'])
pd.DataFrame(one_hot_encoded_data)

,Employee_ID,Remarks_Good,Remarks_Great,Remarks_Nice,Gender_Female,Gender_Male,Gender_Other
0,45,False,False,True,False,True,False
1,78,True,False,False,True,False,False
2,56,False,True,False,True,False,False
3,12,False,True,False,False,True,False
4,7,False,False,True,True,False,False
5,13,False,True,False,False,False,True
6,20,False,False,True,False,False,True

**Missing Value -Mean Replacement**

In [23]:
df=pd.read_csv('P3_missing_data.csv')
df.head(11)

   StudentID  Maths  English
0          1   80.0      NaN
1          2   78.0     80.0
2          3    NaN     60.0
3          4   89.0     47.0
4          5   66.0     90.0
5          6   96.0     83.0
6          7   83.0     70.0
7          8   29.0     35.0
8          9   78.0      NaN
9         10    NaN     90.0

In [14]:
#Null values in each column
df.isnull().sum()

StudentID    0
Maths        2
English      2
dtype: int64

In [18]:
print(df['Maths'].unique())
print(df['English'].unique())

[80. 78. nan 89. 66. 96. 83. 29.]
[nan 80. 60. 47. 90. 83. 70. 35.]